20240210T221504--kdoc-88-ファイルの詳細を調べるstatコマンド__code.org
:properties:
:ID: 20240210T221504
:end:
#+title:      KDOC 88: ファイルの詳細を調べるstatコマンド
#+date:       [2024-02-10 Sat 22:15]
#+filetags:   :code:
#+identifier: 20240210T221504

* この文書のステータス
- 作成
  - [X] 2024-02-10 貴島
- レビュー
  - [X] 2024-02-15 貴島
* 概要
ファイルを詳細に調べるstatコマンドがある。 ~ls -l~ よりも詳しい。

* statコマンド

とくに保存領域まわりは詳しく出る。

#+caption: statコマンド
#+begin_src shell :results raw
  stat README.md
#+end_src

#+RESULTS:
#+begin_src
  File: README.md
  Size: 924       	Blocks: 24         IO Block: 4096   regular file
Device: 37h/55d	Inode: 16522962    Links: 1
Access: (0664/-rw-rw-r--)  Uid: ( 1000/  orange)   Gid: ( 1000/  orange)
Access: 2024-02-10 13:08:44.097786211 +0900
Modify: 2024-02-07 01:14:42.260430101 +0900
Change: 2024-02-07 19:58:28.513060205 +0900
 Birth: -
#+end_src

- 924バイト
- 24ディスクブロック
- 4096 IOブロック
- レギュラーファイル[fn:1]
- デバイス
- Inode
- リンク
- アクセス権
- 最終アクセス
- 最終変更日時
- 作成日時

* 関連
- [[id:20240207T092747][KDOC 77: 検証する方法があると理解が進む]]。検証する方法となる
- [[id:20240209T111023][KDOC 83: CORSを確認する方法]]。より解像度の高い情報が得られると深く理解できるシリーズ

* Footnotes
[fn:1] レギュラーファイルは、デバイスファイルやシンボリックリンクではないものを表す。
