20240210T221504--kdoc-88-ファイルの詳細を調べるstatコマンド__code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-09-19 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 88: ファイルの詳細を調べるstatコマンド</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 88: ファイルの詳細を調べるstatコマンド</h1>

<div id="outline-container-orge24683c" class="outline-2">
<h2 id="orge24683c"><a href="#orge24683c">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orge24683c">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-10 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-15 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga47cfae" class="outline-2">
<h2 id="orga47cfae"><a href="#orga47cfae">概要</a></h2>
<div class="outline-text-2" id="text-orga47cfae">
<p>
ファイルを詳細に調べるstatコマンドがある。 <code>ls -l</code> よりも詳しい。
</p>
</div>
</div>

<div id="outline-container-org8b08aea" class="outline-2">
<h2 id="org8b08aea"><a href="#org8b08aea">statコマンド</a></h2>
<div class="outline-text-2" id="text-org8b08aea">
<p>
とくに保存領域まわりは詳しく出る。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>statコマンド</label><pre class="src src-shell">stat README.md
</pre>
</div>

<pre class="example">
  File: README.md
  Size: 924       	Blocks: 24         IO Block: 4096   regular file
Device: 37h/55d	Inode: 16522962    Links: 1
Access: (0664/-rw-rw-r--)  Uid: ( 1000/  orange)   Gid: ( 1000/  orange)
Access: 2024-02-10 13:08:44.097786211 +0900
Modify: 2024-02-07 01:14:42.260430101 +0900
Change: 2024-02-07 19:58:28.513060205 +0900
 Birth: -
</pre>

<ul class="org-ul">
<li>924バイト</li>
<li>24ディスクブロック</li>
<li>4096 IOブロック</li>
<li>レギュラーファイル<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></li>
<li>デバイス</li>
<li>Inode</li>
<li>リンク</li>
<li>アクセス権</li>
<li>最終アクセス</li>
<li>最終変更日時</li>
<li>作成日時</li>
</ul>
</div>
</div>

<div id="outline-container-org615f5d6" class="outline-2">
<h2 id="org615f5d6"><a href="#org615f5d6">関連</a></h2>
<div class="outline-text-2" id="text-org615f5d6">
<ul class="org-ul">
<li><a href="20240207T092747--kdoc-77-検証する方法があると理解が進む__essay.html#ID-20240207T092747">KDOC 77: 検証する方法があると理解が進む</a>。検証する方法となる</li>
<li><a href="20240209T111023--kdoc-83-corsを確認する__code.html#ID-20240209T111023">KDOC 83: CORSを確認する方法</a>。より解像度の高い情報が得られると深く理解できるシリーズ</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
レギュラーファイルは、デバイスファイルやシンボリックリンクではないものを表す。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
